{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: landing page, crop prediction interface, cost calculator, profit calculator, and farmer dashboard with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose and functionality across pages, components, and utilities.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining OKLCH color palette for light and dark themes using agricultural earth tones.",
  "frontend/index.html": "HTML entry point with root div and module script loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with six routes (landing, dashboard, crop prediction, cost calculator, profit calculator, marketplace) wrapped in ThemeProvider with Toaster notifications.",
  "frontend/src/components/Footer.tsx": "Footer component displaying FARMAI info, quick links, contact section, and attribution to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component rendering Navigation header, page content via Outlet, and Footer for consistent page structure.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation header with FARMAI logo, desktop/mobile menus, active route highlighting, and links to all six main pages.",
  "frontend/src/hooks/useActor.ts": "React hook managing backend actor creation with Internet Identity authentication, handling both authenticated and anonymous actors with query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook providing Internet Identity authentication with login/logout functionality, identity management, and status tracking using AuthClient.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom agricultural-themed color palette (earth tones, forest green, warm brown) for both light and dark modes using CSS custom properties.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/CostCalculatorPage.tsx": "Page component for calculating cultivation costs with form inputs for crop type, land area, and various expenses (seeds, fertilizers, labor, irrigation, equipment), displaying detailed cost breakdown results.",
  "frontend/src/pages/CropPredictionPage.tsx": "Page component for AI-powered crop recommendations based on environmental parameters (temperature, humidity, rainfall) and soil conditions (pH, nitrogen, phosphorus, potassium), displaying prediction results.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying farmer metrics (crops managed, profits, listings, recommendations), quick action cards linking to prediction/calculator tools, and recent activity feed.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, problem statement cards highlighting farmer challenges (wrong crop selection, lack of predictions, middleman exploitation), and feature showcase for the FARMAI platform.",
  "frontend/src/pages/MarketplacePage.tsx": "Marketplace page for listing and browsing crop sales with search/filter functionality, displaying crop listings with farmer details, and dialog form for adding new listings.",
  "frontend/src/pages/ProfitCalculatorPage.tsx": "React page component for profit calculation that accepts cultivation cost, yield quantity, and market price inputs, then displays calculated revenue, profit/loss, and profit margin with visual indicators and toast notifications.",
  "frontend/src/utils/costCalculations.ts": "Utility module that calculates total cultivation costs from itemized inputs (seeds, fertilizers, labor, irrigation, equipment) and returns a breakdown with amounts and percentages for each category.",
  "frontend/src/utils/cropPredictionLogic.ts": "Contains logic to predict suitable crops (rice, wheat, corn, cotton) based on environmental parameters (temperature, humidity, rainfall, pH, NPK levels) and returns top 3 recommendations with confidence scores and reasons.",
  "frontend/src/utils/profitCalculations.ts": "Utility module that calculates revenue, profit, and profit margin from cultivation cost, yield quantity, and market price inputs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings for typography, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata file documenting FARMAI as a React-only agriculture platform with features for crop prediction, cost estimation, profit calculation, and marketplace, including architectural notes, image requirements, and existing feature list."
}