{
  "backend/main.mo": "Main actor implementing user authentication and profile management with role-based access control, supporting admin, farmer, and buyer registration/login with password hashing and permission checks.",
  "feature_evidence.json": "Feature evidence report documenting implemented authentication features including the auth home page, admin/farmer/buyer login/signup forms, and routing updates with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and utilities for the FARMAI agricultural platform with authentication, dashboards, calculators, and marketplace features.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color palette with CSS custom properties for light and dark themes, including agricultural earth tones and UI component tokens.",
  "frontend/index.html": "HTML entry point with basic meta tags, FARMAI title, root div for React mounting, and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for auth, dashboard, tools, marketplace, and admin pages, wrapped in QueryClient and ThemeProvider with protected route guards.",
  "frontend/src/components/Footer.tsx": "Footer component displaying FARMAI branding, quick navigation links, contact section, copyright notice, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component providing consistent structure with Navigation header, main content area via Outlet, and Footer across all pages.",
  "frontend/src/components/Navigation.tsx": "Navigation component that renders a responsive header with logo, navigation links (public/authenticated/admin), and logout functionality. Conditionally displays links based on authentication status and admin privileges using Internet Identity and user profile hooks.",
  "frontend/src/components/ProtectedRoute.tsx": "Route protection component that checks authentication and optionally admin privileges before rendering children. Shows loading states during checks and displays access denied cards with navigation buttons when authentication or authorization fails.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with proper identity configuration. Automatically recreates the actor when identity changes and invalidates/refetches dependent queries.",
  "frontend/src/hooks/useAuth.ts": "Authentication hook providing registration and login functions for farmers, buyers, and admins with password hashing. Manages Internet Identity integration, actor calls for user operations, and query cache invalidation after auth state changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication using @dfinity/auth-client. Manages identity state, login/logout flows, and provides authentication status with proper delegation handling.",
  "frontend/src/hooks/useUserProfile.ts": "Collection of React Query hooks for fetching user profile data and checking user roles (admin, farmer, buyer). Each hook depends on the actor being available and handles loading states appropriately.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom agricultural-themed color palette using OKLCH color space. Defines CSS variables for light and dark modes with earth tones (forest green, warm brown) and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context. Renders the main App component with necessary providers.",
  "frontend/src/pages/AboutPage.tsx": "Landing page component that displays hero section, problem statements, solution features, and platform benefits for FARMAI agricultural platform. Includes navigation to marketplace and main app with cards highlighting crop prediction, cost estimation, and marketplace features.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page that displays user statistics and management interface. Shows total users count with breakdown by type (admins, farmers, buyers) and renders a table listing all registered users with their profiles.",
  "frontend/src/pages/AuthPage.tsx": "Authentication page with three separate sections for admin login, farmer auth, and buyer auth. Provides role-based login/signup forms with email/password inputs and integrates with useAuth hook for authentication.",
  "frontend/src/pages/CostCalculatorPage.tsx": "Cost calculator page for estimating cultivation costs with input form for crop type, land area, and various expense categories. Displays detailed cost breakdown results after calculation using the calculateCost utility function.",
  "frontend/src/pages/CropPredictionPage.tsx": "Crop prediction page that accepts environmental and soil parameters (temperature, humidity, rainfall, pH, NPK values) as inputs. Uses predictCrop utility to generate AI-powered crop recommendations with suitability scores.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying farmer metrics (crops managed, profits, listings, recommendations), quick action cards linking to prediction/calculator tools, and recent activity feed with a background image overlay.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, problem statement cards highlighting farmer challenges (wrong crop selection, lack of predictions, middleman exploitation, market access), and feature showcase for the FARMAI platform.",
  "frontend/src/pages/MarketplacePage.tsx": "Marketplace page for listing and browsing crop sales with search/filter functionality, dialog for adding new listings, and display of crop cards showing farmer contact details and pricing.",
  "frontend/src/pages/ProfitCalculatorPage.tsx": "Profit calculator page with form inputs for cultivation cost, yield quantity, and market price, displaying calculated revenue, profit, and profit margin with visual indicators for profitability.",
  "frontend/src/utils/costCalculations.ts": "Utility module for calculating cultivation cost breakdowns by category (seeds, fertilizers, labor, irrigation, equipment) with percentage distribution and total cost computation.",
  "frontend/src/utils/cropPredictionLogic.ts": "Crop prediction logic using rule-based conditions on environmental parameters (temperature, humidity, rainfall, pH, NPK) to recommend suitable crops (rice, wheat, corn, cotton) with confidence scores and reasoning.",
  "frontend/src/utils/profitCalculations.ts": "Utility module for calculating profit metrics including revenue (yield × price), net profit (revenue - cost), and profit margin percentage.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography, container queries, animations, and custom font families (Inter and Poppins) for the application.",
  "project_state.json": "Project metadata for FARMAI agriculture platform defining implemented features including landing page, crop prediction, cost estimation, profit calculator, farmer dashboard, and marketplace with authentication system."
}