{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add authentication system with admin, farmer, and buyer login/signup as home page",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Create authentication home page with three distinct login/signup sections for Admin, Farmer, and Buyer",
      "acceptanceCriteria": [
        "The authentication page replaces the current landing page as the home route ('/')",
        "Three clearly separated sections are displayed for Admin, Farmer, and Buyer authentication",
        "Each section has appropriate visual styling matching the agricultural theme",
        "Navigation links are updated to reflect the new authentication flow"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AuthPage.tsx",
          "operation": "create",
          "description": "Create new authentication page component with three sections: Admin Login, Farmer Sign In/Sign Up, and Buyer Login/Sign Up. Use Tailwind CSS with the existing agricultural theme (earth tones, forest green, warm brown). Include card-based layout with visual separation between user types. Integrate with the authorization component for authentication functionality."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update router configuration to set AuthPage as the root route ('/'). Move the existing LandingPage route to '/about' or remove it if no longer needed. Ensure authenticated routes (dashboard, calculators, marketplace) are protected and redirect unauthenticated users to '/'."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Update navigation links to reflect the new authentication flow. Show different navigation options based on authentication state and user role. Add logout functionality for authenticated users."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Implement Admin Login form with authentication and redirect to admin dashboard",
      "acceptanceCriteria": [
        "Admin login form includes email and password input fields",
        "Login button triggers authentication logic",
        "Successful admin login redirects to an admin dashboard or management interface",
        "Error messages display for invalid credentials",
        "Admin credentials are validated against backend storage"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AuthPage.tsx",
          "operation": "modify",
          "description": "Add Admin Login form section with email and password input fields. Implement form validation and submission logic that calls backend authentication. Handle authentication errors with toast notifications. On successful admin authentication, redirect to admin dashboard route."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "create",
          "description": "Create admin dashboard page displaying user management interface and administrative controls. Include list of all users with their roles and types. Provide functionality to manage user accounts. Use authorization component to verify admin role access."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add '/admin' route for AdminDashboardPage with admin-only access protection. Ensure route redirects to '/' if user is not authenticated or not an admin."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Implement Farmer Sign In and Sign Up forms with account creation and authentication",
      "acceptanceCriteria": [
        "Farmer section includes toggle or tabs to switch between Sign In and Sign Up",
        "Sign Up form collects email, password, and confirmation password with validation",
        "Sign In form includes email and password fields",
        "Successful farmer authentication redirects to the existing farmer dashboard",
        "New farmer accounts are stored in backend with appropriate user type designation",
        "Error handling for duplicate emails during signup and invalid credentials during signin"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AuthPage.tsx",
          "operation": "modify",
          "description": "Add Farmer authentication section with tab or toggle to switch between Sign In and Sign Up modes. Sign Up form includes email, password, confirmation password, and optional name field with validation (password match, email format). Sign In form includes email and password fields. Call backend registerFarmer for signup and authentication for signin. Display error messages for duplicate emails or invalid credentials. On successful authentication, redirect to '/dashboard'."
        },
        {
          "path": "frontend/src/hooks/useAuth.ts",
          "operation": "create",
          "description": "Create authentication hook that manages user authentication state, provides login/logout functions for different user types (admin, farmer, buyer), and handles session persistence. Integrate with useActor hook for backend calls and useInternetIdentity for identity management. Include methods for registerFarmer, registerBuyer, and authenticate operations."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Implement Buyer Login and Sign Up forms with account creation and authentication",
      "acceptanceCriteria": [
        "Buyer section includes toggle or tabs to switch between Login and Sign Up",
        "Sign Up form collects email, password, and confirmation password with validation",
        "Login form includes email and password fields",
        "Successful buyer authentication redirects to the marketplace page or a buyer-specific view",
        "New buyer accounts are stored in backend with appropriate user type designation",
        "Error handling for duplicate emails during signup and invalid credentials during login"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AuthPage.tsx",
          "operation": "modify",
          "description": "Add Buyer authentication section with tab or toggle to switch between Login and Sign Up modes. Sign Up form includes email, password, confirmation password, and optional name field with validation. Login form includes email and password fields. Call backend registerBuyer for signup and authentication for login. Display error messages for validation failures or backend errors. On successful authentication, redirect to '/marketplace'."
        },
        {
          "path": "frontend/src/hooks/useAuth.ts",
          "operation": "modify",
          "description": "Extend authentication hook with buyer-specific authentication methods and state management. Ensure proper integration with backend registerBuyer and authentication capabilities."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Update application routing to set authentication page as home route and relocate previous landing page",
      "acceptanceCriteria": [
        "The authentication page is set as the root route ('/') in the router configuration",
        "Navigation links are updated to reflect the new structure",
        "The previous landing page content is accessible through a different route (e.g., '/about' or integrated after login)",
        "Protected routes (dashboard, calculators, marketplace) require authentication to access"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Reconfigure routes: set AuthPage as '/', move LandingPage to '/about'. Implement route guards that check authentication state before allowing access to protected routes (/dashboard, /crop-prediction, /cost-calculator, /profit-calculator, /marketplace, /admin). Redirect unauthenticated users to '/' when accessing protected routes."
        },
        {
          "path": "frontend/src/components/ProtectedRoute.tsx",
          "operation": "create",
          "description": "Create ProtectedRoute wrapper component that checks authentication state using useAuth hook. If user is not authenticated, redirect to '/'. Optionally support role-based protection (e.g., admin-only routes). Render child components only when authentication requirements are met."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Update navigation to show different links based on authentication state and user role. Show 'Login' link when not authenticated. Show role-appropriate navigation (Dashboard, Tools, Marketplace) and 'Logout' when authenticated. For admin users, include link to Admin Dashboard. Hide protected routes from anonymous users."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Implement session management with persistent authentication state and logout functionality",
      "acceptanceCriteria": [
        "User authentication state persists across page refreshes using secure session storage",
        "Logout button is available in the navigation for authenticated users",
        "Logging out clears the session and redirects to the authentication home page",
        "Protected routes redirect unauthenticated users to the authentication page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuth.ts",
          "operation": "modify",
          "description": "Implement session persistence using localStorage or sessionStorage to maintain authentication state across page refreshes. Store user role and type securely. Implement logout function that clears session data, invalidates queries using queryClient.clear(), calls useInternetIdentity clear(), and redirects to '/'. Use the authorization component's session management capabilities where appropriate."
        },
        {
          "path": "frontend/src/hooks/useUserProfile.ts",
          "operation": "create",
          "description": "Create hook for managing user profile data using TanStack Query. Implement useGetCallerUserProfile that fetches current user profile from backend with proper loading states to prevent modal flash. Cache user profile and invalidate on logout. Follow the authorization component's pattern for profile setup detection."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Add logout button to navigation that appears for authenticated users. Clicking logout should call the logout function from useAuth hook, clear all cached data, and redirect to '/'. Update navigation styling to accommodate the logout button."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap protected routes with ProtectedRoute component to enforce authentication checks. Ensure route guards check authentication state on initial load and redirect appropriately."
        }
      ]
    }
  ]
}